{
    "basic_info": {
      "description_header": "a Developer, a Researcher, Quant and a Crypto Lover",
      "description": "Jeffrey works as Algo Engineer at BlackRock where he develops advanced algorithms and optimization methods to create next-generation portfolio trading engine. He also has a strong research background in machine learning and large-scale/unstructured data analysis (former Analytical Chemistry Lab Researcher)",
      "passions": "Through various trading competitions and rigorous MFE coursework, Jeffrey possesses hands-on experience in alpha generation, statistical arbitrage, and asset allocation models. He is also passionate about crypto and Defi applications, including a passive income stacking strategy registers 80% APY from yield farm",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "Animal Shelter",
        "startDate": "2020",
        "description": "The most expanded application I had opportunity to work with. I've learned many technologies and my code was reviewed by awesome curator. Application handles all adoption processess and allows to store all evidence on adopting animals from animal shelter.",
        "images": [
          "images/portfolio/animal-shelter/p1.jpg",
          "images/portfolio/animal-shelter/p2.jpg"
        ],
        "url": "",
        "technologies": [
          {
            "class": "devicon-angularjs-plain",
            "name": "Angular"
          },
          {
            "class": "devicon-typescript-plain",
            "name": "TypeScript"
          },
          {
            "class": "devicon-csharp-plain",
            "name": "C#"
          }
        ]
      },
      {
        "title": "Photography",
        "startDate": "2018",
        "description": "Personal project for study subject. I was responsible for testing photography application that optimizes images with popular algorithms used by graphic editors like Pixlr or Adobe Photoshop. I've earned A grade :)",
        "images": [
          "images/portfolio/photography/p1.jpg",
          "images/portfolio/photography/p2.jpg"
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          }
        ]
      },
      {
        "title": "3D Object Viewer",
        "startDate": "2015",
        "description": "One of the first apps I was working on my internship. I had to develop front-end implementation for app that shows 3D models of known buildings. This was also my first project in Angular framework. I've learned a lot!",
        "images": [
          "images/portfolio/adventure/p1.jpg",
          "images/portfolio/adventure/p2.jpg"
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-angularjs-plain",
            "name": "Angular"
          },
          {
            "class": "devicon-typescript-plain",
            "name": "TypeScript"
          },
          {
            "class": "devicon-csharp-plain",
            "name": "C#"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "BlackRock",
        "title": "Algo Engineer Associate, ETF & Index Investing",
        "years": "Feb 2022 - present",
        "mainTech": [
          "asdf"
        ],
        "technologies": [
          "Architect wholistic framework to automate portfolio management through meta-algo to create next-generation trading engine"
          
        ]
      },
      {
        "company": "Western Asset Management",
        "title": "UCLA Joint Researcher",
        "years": "Mar 2021 - Dec 2021",
        "mainTech": [
          "Angular 7/8"
        ],
        "technologies": [
          "Perform a research on the optimization techniques for passive tracking portfolio, including indepth study on stratified sampling in 3-dimensional strata, mix-integer optimizer and asset allocation model"
        ]
      },
      {
        "company": "CBOE Global Markets",
        "title": "Derivative Strats Intern",
        "years": "Jun 2021 - Aug 2021",
        "mainTech": [
          "Angular 7/8"
        ],
        "technologies": [
          "Using machine learning models tools to analyze VIX future trading strategies pattern and building quantitative models to support new index development and derivative in-house pricing librabry"
        ]
      },
      {
        "company": "Rosetta Analytics",
        "title": "Quantitative Analyst Intern",
        "years": "Nov 2020 - Jan 2021",
        "mainTech": [
          "Angular 7/8"
        ],
        "technologies": [
          "Work with Seasoned Quant Reseacher and Machine Learning Engineer do develop comprehensive and robust deep learning model for alpha generation"
        ]
      }
    ]
  }